YaswanthReddy06/stm32-embedded-systems-projects/Module5_I2C_TempSensor/Core/Src/main.c
	//Configure the Speed Register
	// 11: Very High Speed
	// OSPEEDR Bit 29 and Bit 28

	 //RESET both bits 29 and 28 to 0
		 GPIOB->OSPEEDR &= ~ (0x3 << 28);
		//SET the values
		 GPIOB->OSPEEDR |= (0x3 << 28);

}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
  //activate the message transmission once a button is pushed
	//xTaskNotifyFromISR( xTaskToNotify, ulValue, eAction, pxHigherPriorityTaskWoken)
 xTaskNotifyFromISR(pUART_SendMSG, 0, eNoAction,NULL );

}

static void SOS_Transmit(void * parameter)
{
    repeat = 2;
	while (1)
		  {
			  //activated when the user enters the number of repeats

			  //for (int j=0; j<3; j++)
		     // while (repeat > 0)
		while (1)
			  {
				  //transmits SOS three times



		//Sending 'S'
		  for(int i=0; i<3; i++)
		  {
		//light up the LED for a DOT
			  //Write a 1 to Bit 14 of GPIOB ODR (Output Data Register)
		// HAL_GPIO_WritePin(GPIOB, LED2_Pin,GPIO_PIN_SET);
			  GPIOB->ODR |= (1 << 14);

		// HAL_Delay(300);
		vTaskDelay( 300);

		//turn off the LED for spacing
		// HAL_GPIO_WritePin(GPIOB, LED2_Pin, GPIO_PIN_RESET);
		  //Write a 1 to Bit 14 of GPIOB ODR (Output Data Register)
		 GPIOB->ODR &= ~ (1 << 14);

		//HAL_Delay(300);
		 vTaskDelay( 300);
		  }
		  //three times units between characters (two additional units)
		  //HAL_Delay(300 *2);
		  vTaskDelay( 300 *2);

		  //Sending 'O'
		  for(int i=0; i<3; i++)
		  {
			  //light up the LED for a Dash
			 // HAL_GPIO_WritePin(GPIOB, LED2_Pin, GPIO_PIN_SET);
			  //Write a 1 to Bit 14 of GPIOB ODR (Output Data Register)
		  			// HAL_GPIO_WritePin(GPIOB, LED2_Pin,GPIO_PIN_SET);
		  				  GPIOB->ODR |= (1 << 14);

			 // HAL_Delay(300 *3);
		  		vTaskDelay( 300 *3);
			  //turn off the LED for spacing
			  //HAL_GPIO_WritePin(GPIOB, LED2_Pin, GPIO_PIN_RESET);
			  //Write a 0 to Bit 14 of GPIOB ODR (Output Data Register)
			 	  			 GPIOB->ODR &= ~ (1 << 14);
			  //HAL_Delay(300);
			  vTaskDelay( 300);
		  }
		  //three times units between characters(two additional units)
		  //HAL_Delay(300 *2);
		  vTaskDelay( 300 *2);

		  //Sending 'S'
		  	  for(int i=0; i<3; i++)
		  	  {
		  		//light up the LED for a DOT
		  				  //Write a 1 to Bit 14 of GPIOB ODR (Output Data Register)
		  			// HAL_GPIO_WritePin(GPIOB, LED2_Pin,GPIO_PIN_SET);
		  				  GPIOB->ODR |= (1 << 14);

		  			 //HAL_Delay(300);
		  			   vTaskDelay(300);
		  			//turn off the LED for spacing
		  			// HAL_GPIO_WritePin(GPIOB, LED2_Pin, GPIO_PIN_RESET);
		  			  //Write a 0 to Bit 14 of GPIOB ODR (Output Data Register)
		  			 GPIOB->ODR &= ~ (1 << 14);

		  			//HAL_Delay(300);
		  			vTaskDelay( 300);
		  	  }
		  	  //Seven times units between words (six additional units)
		  	  //HAL_Delay(300 *6);
		  	vTaskDelay( 300 *6);

		  	repeat--;

		}
			  //SOS_transmission = 0;

		      xQueueReceive(pUARTQueue, &cmd, portMAX_DELAY);

		      if (cmd -'0' >=1 && cmd -'0' <=3)
		      {
		    	repeat = cmd - '0';
		      }
		      else
		      {
		    	  repeat = 0;
		      }
		  }


}

static void UART_SendMSG(void * parameter)
{

	while (1)
	{

	 HAL_UART_Transmit(&huart1, parameter, strlen(parameter), 1000);
	 //wait for button push to reprint
	 xTaskNotifyWait(0, 0, NULL,portMAX_DELAY);

	}

}



static void TempSensorRead(void * parameter)
{
	char tempReading[100];
	float tempvalue =0;
	while (1)
	{
		tempvalue = BSP_TSENSOR_ReadTemp();
        int tempValueInt = tempvalue;
        float tempvalueFrac =0;

        tempvalueFrac = tempvalue - tempValueInt;

        int tempValueFrac2digits = trunc(tempvalueFrac * 100);

        snprintf(tempReading, 100, "\r\n TEMPERATURE = %1d.%02d\r\n", tempValueInt, tempValueFrac2digits);

        HAL_UART_Transmit(&huart1, (uint8_t *) tempReading, strlen(tempReading), 1000);

		vTaskDelay(5000);

	}
}


void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	/*
	xQueueSendFromISR(pUARTQueue, &receiveBuf, NULL);
	HAL_UART_Receive_IT(&huart1, &receiveBuf, 1);
	*/
}
/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
